# Group By Features

### Introduction

### Loading our Data

Let's get started by loading our imdb data.

In [4]:
import pandas as pd

df = pd.read_csv('./imdb_movies.csv')

In [5]:
df[:2]

,title,genre,budget,runtime,year,month,revenue
0,Avatar,Action,237000000,162.0,2009,12,2787965087
1,Pirates of the Caribbean: At World's End,Adventure,300000000,169.0,2007,5,961000000

### New Features

The general idea behind group by features is that we can learn information about an observation by learning more about the group that it is a part of.  For example, if we see an Action movie from 2009, what's the mean revenue of action movies?  What about the mean revenue of action movies from 2009?  

Beyond considering the mean value of the target, we can also use other statistics.  For example, maybe we should also consider the maximum revenue, minimum revenue and total number of action movies either in total, or from 2009.  Each of these statistics can be used to place an observation in context.  For example, knowing the maximum revenue of an action movie that year can give us a sense of the competition for the rest of the action movies from that year.

Let's see how we can create some of these statistics.

In [18]:
genre_revenue = df.groupby('genre').describe()['revenue']

In [27]:
genre_revenue_scoped = genre_revenue.iloc[:, :4]

In [30]:
genre_cols = [f'genre_revenue_{col}'for col in genre_revenue_scoped.columns]
genre_revenue_scoped.columns = genre_cols

In [31]:
genre_revenue_scoped[:2]

,genre_revenue_genre_revenue_count,genre_revenue_genre_revenue_mean,genre_revenue_genre_revenue_std,genre_revenue_genre_revenue_min
genre,,,,
Action,483.0,1.803353e+08,2.559558e+08,0.0
Adventure,236.0,2.788796e+08,2.789483e+08,0.0

In [33]:
df.join(genre_revenue_scoped, on = 'genre')[:3]

,title,genre,budget,runtime,year,month,revenue,genre_revenue_genre_revenue_count,genre_revenue_genre_revenue_mean,genre_revenue_genre_revenue_std,genre_revenue_genre_revenue_min
0,Avatar,Action,237000000,162.0,2009,12,2787965087,483.0,1.803353e+08,2.559558e+08,0.0
1,Pirates of the Caribbean: At World's End,Adventure,300000000,169.0,2007,5,961000000,236.0,2.788796e+08,2.789483e+08,0.0
2,Spectre,Action,245000000,148.0,2015,10,880674609,483.0,1.803353e+08,2.559558e+08,0.0

### Grouping by Two Categories

Now let's group by month *and* the year.

In [43]:
genre_revenue_year = df.groupby(['genre', 'year']).describe()['revenue']

In [44]:
genre_revenue_year[:2]

             count         mean           std          min           25%  \
genre  year
Action 1978    1.0  300218018.0           NaN  300218018.0  3.002180e+08
       1979    2.0  121031920.5  1.262556e+08   31755742.0  7.639383e+07

                     50%           75%          max
genre  year
Action 1978  300218018.0  3.002180e+08  300218018.0
       1979  121031920.5  1.656700e+08  210308099.0

We can undo the multi-indexing with a call to `reset_index`.

In [59]:
genre_revenue_year.reset_index()[:3]

,genre,year,count,mean,std,min,25%,50%,75%,max
0,Action,1978,1.0,300218018.0,NaN,300218018.0,3.002180e+08,300218018.0,3.002180e+08,300218018.0
1,Action,1979,2.0,121031920.5,1.262556e+08,31755742.0,7.639383e+07,121031920.5,1.656700e+08,210308099.0
2,Action,1980,3.0,64647679.0,1.089695e+08,0.0,1.742166e+06,3484331.0,9.697152e+07,190458706.0

And then we can merge to our original dataframe.

> We cannot use join because we are joining on more than one column.

In [58]:
df.merge(genre_revenue_year.reset_index(), 
        how='left', left_on=['genre','year'], 
        right_on = ['genre','year'])[:3]

,title,genre,budget,runtime,year,month,revenue,count,mean,std,min,25%,50%,75%,max
0,Avatar,Action,237000000,162.0,2009,12,2787965087,19.0,2.843350e+08,6.396596e+08,0.0,13382100.50,60462347.0,1.842761e+08,2.787965e+09
1,Pirates of the Caribbean: At World's End,Adventure,300000000,169.0,2007,5,961000000,12.0,3.200090e+08,3.548982e+08,0.0,73059433.50,166661469.5,4.566036e+08,9.610000e+08
2,Spectre,Action,245000000,148.0,2015,10,880674609,22.0,4.157347e+08,4.904857e+08,0.0,93782370.25,162411174.5,6.076939e+08,1.513529e+09

### The Danger of Mean Target Encoding

So far, by using statistics based on the target value, we run the risk of encoding the target as a feature.  This is a form of data leakage and overfitting -- as we would not have target information on future data.  To avoid this, we can employ cross validation, as we saw in the mean target encoding lesson.  Or we can try to protect against this by finding these statistics on a subset, or different set of data than the data we train on.

Finally, as we'll discuss in the next section, we can avoid target statistics altogether, .

### Beyond Target Statistics

It's worth pointing out that while so far we have grouped by to find statistics based on the target, we can also find statistics that have nothing to do with the target.  For example, in this example, we could look at the average budget per year, per genre, or both, and add that as a feature.

Finally, it is not a far step from this to dividing by this average amount.  Let's do this for budget.  We'll divide budget by the average budget for that year.

In [68]:
mean_budget_by_year = df.groupby(['year']).describe()['budget'][['mean']]
# mean_budget_by_year

In [72]:
mean_budget_by_year.columns = ['mean_budget']

In [75]:
mean_budget_df = df.merge(mean_budget_by_year, right_on = 'year', left_on = 'year')
mean_budget_df[:2]

,title,genre,budget,runtime,year,month,revenue,mean_budget
0,Avatar,Action,237000000,162.0,2009,12,2787965087,65957466.52
1,Harry Potter and the Half-Blood Prince,Adventure,250000000,153.0,2009,7,933959197,65957466.52

In [77]:
budget_percent_mean = mean_budget_df['budget']/mean_budget_df['mean_budget']

In [78]:
df_mean_budget = df.assign(budget_percent_mean = budget_percent_mean)

In [79]:
df_mean_budget[:2]

,title,genre,budget,runtime,year,month,revenue,budget_percent_mean
0,Avatar,Action,237000000,162.0,2009,12,2787965087,3.593225
1,Pirates of the Caribbean: At World's End,Adventure,300000000,169.0,2007,5,961000000,3.790321

### Summary

In this lesson we saw ways to generate features by using groupby.  Groupby is a way of telling us more information about the characteristics of an observation by learning about it's group.  For example, to predict the amount of money a movie will make, it might be good to know about how similar movies from that year performed.  

We can use groupby to encode statistics about the target, or other features.  When adding our statistics, it's important to consider what information we will have at the time of our future predictions.  For example, if we're encoding the average made by movies that year, we won't have that information if we are trying to make predictions for future years.  We also should beware of overfitting when encoding information about the mean.  

Still, the risk of overfitting does not mean that we should avoid these statistics altogether, as we should be able to assess the cost of overfitting by assessing our model on our holdout set.